<template>
    <div class="container mt-4">
        <h1 class="title">FAQ</h1>

        <DropInfo :info="infos" />
    </div>

    <div class="mt-100"></div>
</template>

<script>
import DropInfo from '../../components/ui/drop.info.vue'

export default {
    components: { DropInfo },

    setup() {
        document.title = 'FAQ - GaruDemo store'
        window.scrollTo(0, 0)

        const infos = [
            {
                title: 'Почему переносится дата релиза у манги?',
                desc: 'С 2019 года в мире наблюдается нестабильная ситуация, связанная с дефицитом бумаги и других расходных материалов для печати. Дальнейшие социально-экономические изменения на территории РФ внесли элемент неопределенности при заключении договоров с типографиями, большинство сроков переносится из-за сдвига очереди на печать и проблем с материалами. В момент, когда на книгу открыт предзаказ и выставлены первичные сроки, макет уже готов или будет готов полностью в течение недели. Очень редко главный редактор, получив финальный макет, отправляет его на доработку. Также нельзя забывать о браке и трудностях, связанных с логистикой: иногда задержка книг обусловлена тем, что их не могут привезти на склад довольно длительное время. Как бы то ни было, причина переноса всегда уважительная: XL Media делает все возможное, чтобы соблюдать поставленные сроки.',
            },

            {
                title: 'Почему так долго идет заказ?',
                desc: 'Срок доставки зависит от Вашего местоположения относительно нашего склада в Санкт-Петербурге. Чем дальше Вы от Санкт-Петербурга, тем дольше может ехать посылка.',
            },

            {
                title: 'На каком языке продается манга?',
                desc: 'Вся манга, представленная на нашем сайте, переведена на русский язык.',
            },

            {
                title: 'Что делать, если товар пришел с браком?',
                desc: 'В таком случае Вам необходимо по возможности сфотографировать коробку, в которой Вы получили заказ, накладную, товар, а затем прислать полученные фотографии с описанием ситуации в любое удобное место.',
            },

            {
                title: 'Как узнать заранее приблизительные сроки доставки товара?',
                desc: 'Данную информацию можно уточнить в чате на сайте, нашей группе в социальной сети «ВКонтакте» или по e-mail',
            },
        ]

        return {
            infos,
        }
    },
}
</script>

<style>
</style>